Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.1.171/BZ3/include/component/dgi_spi.h
/* -------- DGI_SPI_SPISTAT : (DGI_SPI Offset: 0x10) ( R/ 32) SPI Status register -------- */
#define DGI_SPI_SPISTAT_RESETVALUE            _UINT32_(0x08)                                       /*  (DGI_SPI_SPISTAT) SPI Status register  Reset Value */

#define DGI_SPI_SPISTAT_SPITBF_Pos            _UINT32_(1)                                          /* (DGI_SPI_SPISTAT) SPI Transmit Buffer Full Status bit Position */
#define DGI_SPI_SPISTAT_SPITBF_Msk            (_UINT32_(0x1) << DGI_SPI_SPISTAT_SPITBF_Pos)        /* (DGI_SPI_SPISTAT) SPI Transmit Buffer Full Status bit Mask */
#define DGI_SPI_SPISTAT_SPITBF(value)         (DGI_SPI_SPISTAT_SPITBF_Msk & (_UINT32_(value) << DGI_SPI_SPISTAT_SPITBF_Pos)) /* Assigment of value for SPITBF in the DGI_SPI_SPISTAT register */
#define   DGI_SPI_SPISTAT_SPITBF_TXB_NOT_FULL_Val _UINT32_(0x0)                                        /* (DGI_SPI_SPISTAT) SPIxTXB not full  */
#define   DGI_SPI_SPISTAT_SPITBF_TXB_FULL_Val _UINT32_(0x1)                                        /* (DGI_SPI_SPISTAT) SPIxTXB is full  */
#define DGI_SPI_SPISTAT_SPITBF_TXB_NOT_FULL   (DGI_SPI_SPISTAT_SPITBF_TXB_NOT_FULL_Val << DGI_SPI_SPISTAT_SPITBF_Pos) /* (DGI_SPI_SPISTAT) SPIxTXB not full Position  */
#define DGI_SPI_SPISTAT_SPITBF_TXB_FULL       (DGI_SPI_SPISTAT_SPITBF_TXB_FULL_Val << DGI_SPI_SPISTAT_SPITBF_Pos) /* (DGI_SPI_SPISTAT) SPIxTXB is full Position  */
#define DGI_SPI_SPISTAT_SPITBE_Pos            _UINT32_(3)                                          /* (DGI_SPI_SPISTAT) SPI Transmit Buffer Empty status bit Position */
#define DGI_SPI_SPISTAT_SPITBE_Msk            (_UINT32_(0x1) << DGI_SPI_SPISTAT_SPITBE_Pos)        /* (DGI_SPI_SPISTAT) SPI Transmit Buffer Empty status bit Mask */
#define DGI_SPI_SPISTAT_SPITBE(value)         (DGI_SPI_SPISTAT_SPITBE_Msk & (_UINT32_(value) << DGI_SPI_SPISTAT_SPITBE_Pos)) /* Assigment of value for SPITBE in the DGI_SPI_SPISTAT register */
#define   DGI_SPI_SPISTAT_SPITBE_TXB_NOT_EMPTY_Val _UINT32_(0x0)                                        /* (DGI_SPI_SPISTAT) SPIxTXB is not empty  */
#define   DGI_SPI_SPISTAT_SPITBE_TXB_EMPTY_Val _UINT32_(0x1)                                        /* (DGI_SPI_SPISTAT) SPIxTXB is empty  */
#define DGI_SPI_SPISTAT_SPITBE_TXB_NOT_EMPTY  (DGI_SPI_SPISTAT_SPITBE_TXB_NOT_EMPTY_Val << DGI_SPI_SPISTAT_SPITBE_Pos) /* (DGI_SPI_SPISTAT) SPIxTXB is not empty Position  */
#define DGI_SPI_SPISTAT_SPITBE_TXB_EMPTY      (DGI_SPI_SPISTAT_SPITBE_TXB_EMPTY_Val << DGI_SPI_SPISTAT_SPITBE_Pos) /* (DGI_SPI_SPISTAT) SPIxTXB is empty Position  */
#define DGI_SPI_SPISTAT_SRMT_Pos              _UINT32_(7)                                          /* (DGI_SPI_SPISTAT) Shift Register (SPIxSR) Empty bit0= There are current or pending transactions Position */
#define DGI_SPI_SPISTAT_SRMT_Msk              (_UINT32_(0x1) << DGI_SPI_SPISTAT_SRMT_Pos)          /* (DGI_SPI_SPISTAT) Shift Register (SPIxSR) Empty bit0= There are current or pending transactions Mask */
#define DGI_SPI_SPISTAT_SRMT(value)           (DGI_SPI_SPISTAT_SRMT_Msk & (_UINT32_(value) << DGI_SPI_SPISTAT_SRMT_Pos)) /* Assigment of value for SRMT in the DGI_SPI_SPISTAT register */
#define   DGI_SPI_SPISTAT_SRMT_SRMT_NO_TRANS_Val _UINT32_(0x1)                                        /* (DGI_SPI_SPISTAT) There are no current or pending transactions  */
#define DGI_SPI_SPISTAT_SRMT_SRMT_NO_TRANS    (DGI_SPI_SPISTAT_SRMT_SRMT_NO_TRANS_Val << DGI_SPI_SPISTAT_SRMT_Pos) /* (DGI_SPI_SPISTAT) There are no current or pending transactions Position  */
#define DGI_SPI_SPISTAT_SPIBUSY_Pos           _UINT32_(11)                                         /* (DGI_SPI_SPISTAT) SPI activity status bit Position */
#define DGI_SPI_SPISTAT_SPIBUSY_Msk           (_UINT32_(0x1) << DGI_SPI_SPISTAT_SPIBUSY_Pos)       /* (DGI_SPI_SPISTAT) SPI activity status bit Mask */
#define DGI_SPI_SPISTAT_SPIBUSY(value)        (DGI_SPI_SPISTAT_SPIBUSY_Msk & (_UINT32_(value) << DGI_SPI_SPISTAT_SPIBUSY_Pos)) /* Assigment of value for SPIBUSY in the DGI_SPI_SPISTAT register */
#define   DGI_SPI_SPISTAT_SPIBUSY_SPI_FREE_Val _UINT32_(0x0)                                        /* (DGI_SPI_SPISTAT) No on-going transactions (at time of read)  */
#define   DGI_SPI_SPISTAT_SPIBUSY_SPI_BUSY_Val _UINT32_(0x1)                                        /* (DGI_SPI_SPISTAT) Macro currently busy with some transactions  */
#define DGI_SPI_SPISTAT_SPIBUSY_SPI_FREE      (DGI_SPI_SPISTAT_SPIBUSY_SPI_FREE_Val << DGI_SPI_SPISTAT_SPIBUSY_Pos) /* (DGI_SPI_SPISTAT) No on-going transactions (at time of read) Position  */
#define DGI_SPI_SPISTAT_SPIBUSY_SPI_BUSY      (DGI_SPI_SPISTAT_SPIBUSY_SPI_BUSY_Val << DGI_SPI_SPISTAT_SPIBUSY_Pos) /* (DGI_SPI_SPISTAT) Macro currently busy with some transactions Position  */
#define DGI_SPI_SPISTAT_TXBUFELM_Pos          _UINT32_(16)                                         /* (DGI_SPI_SPISTAT) TransmitBuffer Element Count bits (valid only when ENHBUF = 1) Position */
#define DGI_SPI_SPISTAT_TXBUFELM_Msk          (_UINT32_(0x1F) << DGI_SPI_SPISTAT_TXBUFELM_Pos)     /* (DGI_SPI_SPISTAT) TransmitBuffer Element Count bits (valid only when ENHBUF = 1) Mask */
#define DGI_SPI_SPISTAT_TXBUFELM(value)       (DGI_SPI_SPISTAT_TXBUFELM_Msk & (_UINT32_(value) << DGI_SPI_SPISTAT_TXBUFELM_Pos)) /* Assigment of value for TXBUFELM in the DGI_SPI_SPISTAT register */
#define DGI_SPI_SPISTAT_Msk                   _UINT32_(0x001F088A)                                 /* (DGI_SPI_SPISTAT) Register Mask  */


/* -------- DGI_SPI_SPIBUF : (DGI_SPI Offset: 0x20) (R/W 32) SPI BUFFER register -------- */
#define DGI_SPI_SPIBUF_RESETVALUE             _UINT32_(0x00)                                       /*  (DGI_SPI_SPIBUF) SPI BUFFER register  Reset Value */

#define DGI_SPI_SPIBUF_DATA_Pos               _UINT32_(0)                                          /* (DGI_SPI_SPIBUF) FIFO Data bits Position */
#define DGI_SPI_SPIBUF_DATA_Msk               (_UINT32_(0xFFFFFFFF) << DGI_SPI_SPIBUF_DATA_Pos)    /* (DGI_SPI_SPIBUF) FIFO Data bits Mask */
#define DGI_SPI_SPIBUF_DATA(value)            (DGI_SPI_SPIBUF_DATA_Msk & (_UINT32_(value) << DGI_SPI_SPIBUF_DATA_Pos)) /* Assigment of value for DATA in the DGI_SPI_SPIBUF register */
#define DGI_SPI_SPIBUF_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (DGI_SPI_SPIBUF) Register Mask  */


